<?php
/**
 * 自定义配置
 */

//年份列表
$config['year'] = array(2015=>'2015年');
//时间单位列表
$config['timeUnit'] = array(
    1 => '1-2月',
    2 => '3-4月',
    3 => '5-6月',
    4 => '7-8月',
    5 => '9-10月',
    6 => '11-12月'
);
//角色名称
$config['roleList'] = array(
    1=>'专营店',
    2=>'小区督导',
    3=>'大区总监',
    4=>'区域总监',
    5=>'总部',
    6=>'查看端'
);
//审核结果
$config['auditRs'] = array(
    -1  => '<span style="color:red">未提交</span>',
    0   => '未审核',
    1   => '已通过',
    2   => '不通过',
    3   => '返回修改',
    4   => '部分通过'
);
//活动类型
$config['projectEventType'] = array(1=>'店头', 2 => '户外');
//活动分类
$config['projectEventClass'] = array(
    1 => array(1 => "闭馆销售", 2 => "保客活动", 3 => "大客户活动", 4 => "新车上市", -1 => "其他"),
    2 => array(1 => "户外试驾", 2 => "自驾游", 3 => "巡展车展", 4 => "新车上市", 5 => "保客活动", 6 => "大客户活动", -1 => "其他"),
);
//一级媒体列表
$config['gxMediaType1'] = array(1=>'常规媒体',2=>'创新形式', 3=>'户外大牌', -1 => '其它');
//二级媒体列表
$config['gxMediaType2'] = array(
    1 => array(
        1 => "报纸",
        2 => "网络",
        3 => "电视",
        4 => "电台",
    ),
    2 => array(
        1 => "商超合作",
        2 => "驾校合作",
        3 => "加油站广告",
        4 => "停车场广告",
        5 => "公交亭广告",
        6 => "车体广告",
        7 => "电影院广告",
        8 => "社区广告",
        9 => "电梯海报",
        10 => "地铁海报",
        11 => "楼宇视频",
        12 => "DM单",
    ),
    3 => array(
        1 => '立柱',
        2 => '楼顶',
        3 => '墙体',
        4 => 'LED/LCD',
        -1 => '其它',
    ),
);
//传统媒体的媒体规格列表
$config['gxMediaType21Size'] = array(
    //报纸
    1 => array(
        1	=>	'报眼',
        2	=>	'报花',
        3	=>	'半通栏',
        4	=>	'通栏',
        5	=>	'1/8版',
        6	=>	'1/4版',
        7	=>	'1/2版',
        8	=>	'整版',
        9	=>	'报刊夹页',
        -1  =>  '其它',
    ),
    //网络
    2 => array(
        1	=>	'浮标',
        2	=>	'上栏',
        3	=>	'通栏',
        4	=>	'文章内页上栏',
        5	=>	'文章内页中栏',
        6	=>	'文章内页下栏',
        7	=>	'文章内页对联',
        8	=>	'擎天柱',
        9	=>	'弹出窗口',
        10	=>	'文字链点',
        11	=>	'Banner',
        12	=>	'全屏',
        -1	=>   '其它',
    ),
    //电视
    3 => array(
        1	=>	'5秒',
        2	=>	'10秒',
        3	=>	'15秒',
        4	=>	'20秒',
        5	=>	'25秒',
        6	=>	'30秒',
        -1	=>	'其它',
    ),
    //电台
    4 => array(
        1	=>	'5秒',
        2   =>  '15秒',
        3	=>	'30秒',
        4	=>	'60秒',
        5	=>	'90秒',
        6	=>	'180秒',
        -1	=>	'其它',
    ),
);
//线下活动-活动明细-明细类型
$config['offlineDetailType'] = array(
    1 => '场馆配套费用',
    2 => '活动组织费用',
);
//线下活动-活动明细-费用项目描述
$config['offlineDetailDescType'] = array(
    1=>array(
        1 => "场地租金",
        2 => "特装管理费",
        3 => "水电费",
        4 => "叉车费",
        5 => "吊车租赁费",
        6 => "加班费",
        -1 => "其它",
    ),
    2=>array(
        1 => "物料布置",
        2 => "表演运营",
        3 => "人员聘用",
        4 => "媒体接待",
        -1 => "其它",
    )
);






